{"class_name": "Model", "config": {"name": "model_9", "layers": [{"name": "Input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 64, 3], "dtype": "float32", "sparse": false, "name": "Input"}, "inbound_nodes": []}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["Input", 0, 0, {}]]]}, {"name": "E1", "class_name": "Conv2D", "config": {"name": "E1", "trainable": true, "filters": 64, "kernel_size": [5, 5], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"name": "E2", "class_name": "Conv2D", "config": {"name": "E2", "trainable": true, "filters": 50, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["E1", 0, 0, {}]]]}, {"name": "E3", "class_name": "Conv2D", "config": {"name": "E3", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["E2", 0, 0, {}]]]}, {"name": "E4", "class_name": "Conv2D", "config": {"name": "E4", "trainable": true, "filters": 32, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["E3", 0, 0, {}]]]}, {"name": "D1", "class_name": "Conv2D", "config": {"name": "D1", "trainable": true, "filters": 32, "kernel_size": [2, 2], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["E4", 0, 0, {}]]]}, {"name": "up_sampling2d_25", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_25", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["D1", 0, 0, {}]]]}, {"name": "D2", "class_name": "Conv2D", "config": {"name": "D2", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_25", 0, 0, {}]]]}, {"name": "up_sampling2d_26", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_26", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["D2", 0, 0, {}]]]}, {"name": "D3", "class_name": "Conv2D", "config": {"name": "D3", "trainable": true, "filters": 50, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_26", 0, 0, {}]]]}, {"name": "up_sampling2d_27", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_27", "trainable": true, "size": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["D3", 0, 0, {}]]]}, {"name": "D4", "class_name": "Conv2D", "config": {"name": "D4", "trainable": true, "filters": 1, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["up_sampling2d_27", 0, 0, {}]]]}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["D4", 0, 0, {}]]]}, {"name": "Recon", "class_name": "Lambda", "config": {"name": "Recon", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcwwAAAB0AGoBfABkAYMCUwApAk7pAwAAACkC2gFL2gdzcXVl\nZXplKQHaAnh4qQByBQAAAPpUL1VzZXJzL3N5cC9PbmVEcml2ZSAtIERhcnRtb3V0aCBDb2xsZWdl\nL2NhcmVlci9naXQvbXJlL0R1YWxPYmplY3RpdmVFeHBlcmltZW50c18yLnB52gg8bGFtYmRhPn8A\nAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"name": "StackedMu", "class_name": "Lambda", "config": {"name": "StackedMu", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAQAAABDAAAAcxYAAAB0AGoBagJ8AHwAfABnA2QBZAKNAlMAKQNO6QMAAAAp\nAdoEYXhpcykD2gFL2gJ0ZtoFc3RhY2spAdoBeakAcgcAAAD6VC9Vc2Vycy9zeXAvT25lRHJpdmUg\nLSBEYXJ0bW91dGggQ29sbGVnZS9jYXJlZXIvZ2l0L21yZS9EdWFsT2JqZWN0aXZlRXhwZXJpbWVu\ndHNfMi5wedoHbXVTdGFja1sAAABzAgAAAAAB\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["Recon", 0, 0, {}]]]}, {"name": "Laplacian", "class_name": "Lambda", "config": {"name": "Laplacian", "trainable": true, "function": ["4wEAAAAAAAAABQAAAAcAAABDAAAAc4YAAAB0AGoBdAJ8AGQAZACFAmQAZACFAmQAZACFAmQBZgQZ\nAIMCfQF0AGoBdAJ8AGQAZACFAmQAZACFAmQAZACFAmQCZgQZAIMCfQJ0AGoBdAJ8AGQAZACFAmQA\nZACFAmQAZACFAmQDZgQZAIMCfQN0AGoDagR8AXwCfANnA2QEZAWNAn0EfARTACkGTukAAAAA6QEA\nAADpAgAAAOkDAAAAKQHaBGF4aXMpBdoBS9oGbWFwX2Zu2gdsYXBsYWNl2gJ0ZtoFc3RhY2spBdoB\neNoCdTHaAnUy2gJ1M9oBdakAchAAAAD6VC9Vc2Vycy9zeXAvT25lRHJpdmUgLSBEYXJ0bW91dGgg\nQ29sbGVnZS9jYXJlZXIvZ2l0L21yZS9EdWFsT2JqZWN0aXZlRXhwZXJpbWVudHNfMi5wedoLbGFw\nbGFjaWFuM0RSAAAAcwoAAAAAASQBJAEkAhYB\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["Input", 0, 0, {}]]]}, {"name": "aux_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 64, 64, 3], "dtype": "float32", "sparse": false, "name": "aux_input"}, "inbound_nodes": []}, {"name": "equal", "class_name": "Multiply", "config": {"name": "equal", "trainable": true}, "inbound_nodes": [[["StackedMu", 0, 0, {}], ["Laplacian", 0, 0, {}]]]}, {"name": "equlr", "class_name": "Multiply", "config": {"name": "equlr", "trainable": true}, "inbound_nodes": [[["aux_input", 0, 0, {}], ["Input", 0, 0, {}]]]}, {"name": "Mre", "class_name": "Add", "config": {"name": "Mre", "trainable": true}, "inbound_nodes": [[["equal", 0, 0, {}], ["equlr", 0, 0, {}]]]}], "input_layers": [["Input", 0, 0], ["aux_input", 0, 0]], "output_layers": [["Recon", 0, 0], ["Mre", 0, 0]]}, "keras_version": "2.1.2", "backend": "tensorflow"}